app/controllers/api/holdings_controller.rb

  def show
    @holding = Holding.find(params[:id])
---
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    @holdings = Holding.all
---
SELECT "holdings".* FROM "holdings"

  def create
    @holding = Holding.new(holding_params)
    if @holding.save!
---
INSERT INTO "holdings" ("name", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "magic"], ["quantity", 7], ["user_id", 1], ["created_at", "2021-04-15 03:40:34.102220"], ["updated_at", "2021-04-15 03:40:34.102220"]]

  def update
    @holding = Holding.find(params[:id])
    starting_size = @holding.quantity
    @holding.quantity = params[:quantity]

    if @holding.save
---
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "holdings" SET "quantity" = $1, "updated_at" = $2 WHERE "holdings"."id" = $3  [["quantity", 4], ["updated_at", "2021-04-15 03:32:19.916828"], ["id", 1]]

  def destroy
    @holding = Holding.find(params[:id])
    @holding.delete
---
SELECT  "holdings".* FROM "holdings" WHERE "holdings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "holdings" WHERE "holdings"."id" = $1  [["id", 3]]