app/controllers/api/tracked_coins_controller.rb

SELECT  "tracked_coins".* FROM "tracked_coins" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @tracked_coins = TrackedCoin.all

INSERT INTO "tracked_coins" ("created_at", "updated_at", "name", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2021-04-13 23:24:13.706067"], ["updated_at", "2021-04-13 23:24:13.706067"], ["name", "another"], ["user_id", 1]]
---
  def create
    @tracked_coin = TrackedCoin.create(tracked_coin_params)

SELECT  "tracked_coins".* FROM "tracked_coins" WHERE "tracked_coins"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "tracked_coins" WHERE "tracked_coins"."id" = $1  [["id", 2]]
---
  def destroy
    @tracked_coin = TrackedCoin.find(params[:id])
    @tracked_coin.delete