app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "buying_power", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save